

#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Структура = Новый Структура("Тест, Число", Истина, 1);
	Структура.Вставить("Буква", "А");
	Структура.Число = 12;
	Поехали();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Поехали", 1, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Поехали() Экспорт
	
	Сообщить("12");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьБукву(Структура)
	
	Структура.Вставить("Буква", "А");
	
КонецПроцедуры

#КонецОбласти

